[
  {
    "path": "posts/2021-12-12-our-house/",
    "title": "Our house",
    "description": "How it started.",
    "author": [
      {
        "name": "Stephen James Price",
        "url": {}
      }
    ],
    "date": "2021-12-12",
    "categories": [
      "existing",
      "plans"
    ],
    "contents": "\nWe moved into an end-terrace in Stourbridge in 2019. The house was built sometime between 1970 & 1972 and is a really simple box over 3 floors with a flat roof. We liked the size and simple, modest nature of the house as well as its location near to a mainline railway station into Birmingham (and London) and a short walk from a bustling town centre full of independent businesses. It’s also close to a run of shops and a secondary school with a great culture.\nThe house has an internal garage with a kitchen on the back and the lounge on the first-floor. There’s a drive to the front and a small garden at the rear. The floorplan and existing elevations are shown in figs 1-4.\nFigure 1: Existing ground floor planFigure 2: Existing first floor planFigure 3: Existing second floor planFigure 4: Existing front and rear elevationsMany of the other houses on the street that were built at the same time have been extended at the back and modernised to some extent by installing standard gas central heating with radiators, or recovering the roof, or such. Others have tweaked the internal layout slightly, through basic garage conversions or pinching space from the first floor landing to enlarge the main bathroom and/or the second floor rear bedroom to turn the WC into a shower room.\nOurs was largely as was originally built except for new windows and the removal of a floor to ceiling cupboard in the corner of the kitchen. It still had the original warm air heating system but this packed up after the first winter in the house! Anyway, we liked this about the house, it needed to be given a new lease of life and we were up for it 😄.\nIn terms of its passivhaus potential with respect to the main design elements (read more about passivhaus principles and design elsewhere on this site):\nits simple shape was excellent but its east-facing orientation not ideal.\nIt has cavity walls (retrospectively filled with Knauff 34 pumped in insulation) at the side and rear but no insulation at all in the front wall, ground floor or roof.\nI’d guess there are several cash-machine sized holes in the building if you brought together all the holes and gaps!\nWe were definitely excited about our blank canvas 😄.\n\n\n\n",
    "preview": "posts/2021-12-12-our-house/../../images/elevations.png",
    "last_modified": "2021-12-12T22:27:42+00:00",
    "input_file": {},
    "preview_width": 2070,
    "preview_height": 1180
  }
]
