[
  {
    "path": "posts/2021-12-20-a-plan/",
    "title": "A plan",
    "description": "2.5 years of thinking about space and energy",
    "author": [
      {
        "name": "Stephen J. Price",
        "url": {}
      }
    ],
    "date": "2021-12-20",
    "categories": [
      "plans"
    ],
    "contents": "\nIn 2019, my very basic plan was:\n✅ buy a house (see Our house),\n✅ learn a lot more about low-energy retrofit (thank you AECB CarbonLite Retrofit),\n✅ learn to plaster as a simple airtightness method (thank you Walsall construction training),\n❌ get a local architect to design a single storey extension (under permitted development) and garage conversion.\nWe soon realised that we had an opportunity to go further with the low-energy side of the project and should aim for a deep retrofit. On the remodeling side of the project, I was pretty uninspired by the first designer I got on board who basically drew what I told him without bringing any creative vision. They also didn’t really have the low-energy expertise to support me on the retrofit side.\nAfter reading about a comparable retrofit project by Chris Copeman (in Passive House + magazine), we got the same architect, Gil Schalom, on board and were immediately impressed with his ideas and assured by his enthusiasm and expertise.\nThe plans have developed iteratively since. Covid lockdowns brought new demands in terms of how we used and thought about our home and the spaces it offers and all that time at home helped unearth, develop or reinforce the ways it worked and didn’t. Moving into rental accommodation and seeing how having more space allowed our youngest to play brought back a nagging worry about the space in the smaller, third bedroom and prompted us to squeeze the bathroom to give more space to that. And smashing the place up to reveal more of the structure at the start of the work, prompted a few other little tweaks, but what we’ve ended up with is not far off the early brief:\nSo, by December 2021, having gutted the place and done a fair bit of the destruction, we have a pretty firm plan and the following sections cover all the major remodelling, extension and making new.\nRear extension\nWe are building at the back to create a large kitchen-diner.\nThis single-storey extension will be built from timber i-joists, filled with Warmcel recycled newspaper and clad in vertical cedar.\nIt will have a living roof that starts just under the first floor window cill height and slopes down (~7° pitch) to match the height of the neighbours’ extension on the party wall side.\nGlazing is hopefully optimised to bring light down into the existing house without overheating (the house is East-facing so the sun is on the back all afternoon). We’re also adding a window to the existing kitchen (over the sink).\nWe’ll have an extra 2.5m of depth internally across the full width (~4.5m) so plenty of space for cooking, dining, doing homework, working, etc.\nThe extension will be built on a raft foundation and this will join with the existing house in a continuous slab as we will be breaking out the existing to insulate under.\nExtension with living roof to the kitchenHouse front and garage conversion\nThe internal garage will become a flexible space that can work as an office, a project and crafting room, a guest bedroom and utility/plant room. To do this we’ll also pinch some space from the very wide hallway and a couple of large built-in cupboards (one housing the gas, which is being disconnected, and the electricity, and the other housed the old warm air heating).\nThe existing front is mostly garage door, main entrance and windows. There’s a bit of cavity wall at ground floor level but then it’s solid at first floor and timber stud and tiled at second floor level (supported by a big concrete beam). We’re going to knock it down below the beam and rebuild in timber frame, as per the extension with the same cedar-cladding at ground-level (planners insisted we maintained the street-view rather than replace the existing first-floor horizontal cladding as well, which is what we proposed). At second-floor level, we’ll remove the tiles to replace the existing felt vapour control layer in order to be able to insulate between the studs (no insulation at present 🙀) and add some insulation cheeks around the dormer window where up to now we’ve only been separated from the elements by a bit of lead and a sheet of hardboard! We’ll also add some fire-stop insulation to the front edge of the party wall so that we can no longer reach through and knock on the plasterboard of our neighbours’ bedroom 🤣.\nThe look of the renovated frontRoof\nThe existing roof is weird and has never been renovated as far as I can tell. It’s a flat roof with a “woodwool” deck that was apparently covered by pouring a liquid bitumen and adding a bit of felt around the edges to create shallow parapets.\nFor most of the planning period, we’ve been thinking of covering the existing roof with celotex (oil-based) insulation but were always keen to have the option to add solar (PV) in ballast trays later. We gradually realised that the roof was going to be expensive and extensive however we dealt with it. The existing joists are pretty small at 150mm by 50mm and not fit to take any additional weight, so we’ve eventually opted to take the whole roof off and replace it with an i-joist and Warmcel combination as per the other new structural elements. Ultimately, this gives us a stronger and future-proofed (ready for PV) roof using sustainable products. It will be raised compared to existing (agreed with planners) but stepped down at edges with integral gutters so won’t look much different from the street to the rest of the terrace.\nOther remodeling\nBathroom and “third” bedroom - These rooms will swallow most of the first floor landing and the partition is being moved over. The third bedroom will be significantly bigger and its entrance moved round to the bottom of the second stair to make it feel more connected to the second floor bedrooms whilst no longer feeling so clearly like the “small” bedroom relative to the others.\nSecond shower - the needlessly large “main” bedroom will be trimmed to make room for a shower room. Other houses on our street have sacrificed the size of the second bedroom to convert the second-floor WC into a small, second bathroom. This idea never appealed to me as bedroom 1 is too big but bedroom 2 is a great size. Our shower won’t have a window and adds a complication in having to get the waste back over towards the rear but ends up with two nicely sized second floor bedrooms and a symmetrical landing leading to the shower and WC on each side.\n\nExternal wall insulation (EWI)\nThe existing cavity walls have been filled with a good blow-in insulation but the thermal performance is still pretty modest as the cavity is not very big. Where we are retaining them, above the extension at the rear and down the side, we are going to had 200mm of polystyrene (EPS). Most of it will be rendered but the planners wanted brick-slips for the first 2m to maintain the street-view so we’ve had to go along with that (despite the expense and resources).\nExternal wall insulation at the side with mixture of render and brickslipsHeat and hot water\nWe only got one winter out of our old warm air heating before it died just as we went into our second winter in the house. The local heating and gas engineering company that service most the warm air heating in the area felt it had come to the end of its life so we went forward with plug-ins and a Calor gas heater. We’re ripping out all the ducting to replace with an air source heat pump, hot water cylinder and underfloor heating (UFH) on all floors (replacing floorboards upstairs with structural routed chipboard). Given the very low heating demand you get with a passivhaus, this is overkill but having heated floors everywhere is definitely going to be luxurious and we also won’t take up any wall space with oversized radiators meaning less restrictions in terms of changing up room configurations. Of course, floor finish matters for UFH: we’ll finish the ground floor by polishing the concrete (⛑ for a suitably smooth finish when we put the slab in!) and tile the bathroom floors but are still to work out floor finishes elsewhere.\nAirtightness & ventilation\nWe’ll be scaling our stack of cash-machine-sized holes down to a bank-card-sized version (more about this on the “Passivhaus” page) using a combination of airtight sheating, airtightness tapes and plaster with a few special grommets for penetrations. It seems hard to make a good job of passivhaus levels of airtightness so expect some focus on detailing this for the various elements in the upcoming posts.\nVentilation will be taken care of by a mechanical unit with heat recovery (MVHR, read more about that via Green Building Store). Essentially, supply and extract ducts push fresh air in and pull stale air out whilst transferring the heat between them at high efficiency to limit heat loss whilst ensuring a really healthy living environment. Our system is being designed by Green Building Store but has still required a lot of thought and head-scratching from me so look out for a dedicated post on this.\nMechanical ventilation with heat recovery: 3D schematic\n\n\n",
    "preview": {},
    "last_modified": "2021-12-23T12:23:22+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-12-12-our-house/",
    "title": "Our house",
    "description": "How it started.",
    "author": [
      {
        "name": "Stephen James Price",
        "url": {}
      }
    ],
    "date": "2021-12-12",
    "categories": [
      "existing",
      "plans"
    ],
    "contents": "\nWe moved into an end-terrace in Stourbridge in 2019. The house was built sometime between 1970 & 1972 and is a really simple box over 3 floors with a flat roof. We liked the size and simple, modest nature of the house as well as its location near to a mainline railway station into Birmingham (and London) and a short walk from a bustling town centre full of independent businesses. It’s also close to a run of shops and a secondary school with a great culture.\nThe house has an internal garage with a kitchen on the back and the lounge on the first-floor. There’s a drive to the front and a small garden at the rear. The floorplan and existing elevations are shown in figs 1-4.\nFigure 1: Existing ground floor planFigure 2: Existing first floor planFigure 3: Existing second floor planFigure 4: Existing front and rear elevationsMany of the other houses on the street that were built at the same time have been extended at the back and modernised to some extent by installing standard gas central heating with radiators, or recovering the roof, or such. Others have tweaked the internal layout slightly, through basic garage conversions or pinching space from the first floor landing to enlarge the main bathroom and/or the second floor rear bedroom to turn the WC into a shower room.\nOurs was largely as was originally built except for new windows and the removal of a floor to ceiling cupboard in the corner of the kitchen. It still had the original warm air heating system but this packed up after the first winter in the house! Anyway, we liked this about the house, it needed to be given a new lease of life and we were up for it 😄.\nIn terms of its passivhaus potential with respect to the main design elements (read more about passivhaus principles and design elsewhere on this site):\nits simple shape was excellent but its east-facing orientation not ideal.\nIt has cavity walls (retrospectively filled with Knauff 34 pumped in insulation) at the side and rear but no insulation at all in the front wall, ground floor or roof.\nI’d guess there are several cash-machine sized holes in the building if you brought together all the holes and gaps!\nWe were definitely excited about our blank canvas 😄.\n\n\n\n",
    "preview": "posts/2021-12-12-our-house/../../images/elevations.png",
    "last_modified": "2021-12-12T22:27:42+00:00",
    "input_file": {},
    "preview_width": 2070,
    "preview_height": 1180
  }
]
